In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
hospitalizations= "Resources/in_by_county.csv"
indiana_db= pd.read_csv(hospitalizations)
indiana_db.head()

       Date County  ED Visit Count  Hospitalization Count
0  3/1/2020  Adams               1                      1
1  3/2/2020  Adams               0                      1
2  3/3/2020  Adams               0                      0
3  3/4/2020  Adams               1                      0
4  3/5/2020  Adams               0                      0

In [3]:
doh= "Resources/indiana_covid_report_county_ISDH.csv"
doh_db=  pd.read_csv(doh)
doh_db.head()

   LOCATION_ID  COVID_COUNT  COVID_DEATHS  COVID_TEST  COUNTY_NAME
0        18001         1959            24        8775        Adams
1        18003        21054           342      116465        Allen
2        18005         3915            66       27955  Bartholomew
3        18007          465             3        3190       Benton
4        18009          673            17        3997    Blackford

Regenstrief Institute - Indiana Hospitalizations TRANSFORMATION

In [7]:
# Create a filtered dataframe from specific columns
Indiana_cols = ["County", "Hospitalization Count"]
indiana_transformed= indiana_db[Indiana_cols].copy()
indiana_transformed.head()

indiana_transformed = indiana_transformed.rename(columns={"County": "county",
                                                            "Hospitalization Count": "hospitalization_count"})



# Clean the data by dropping duplicates and setting the index
indiana_transformed.set_index("county", inplace=True)

indiana_transformed

         hospitalization_count
county
Adams                        1
Adams                        1
Adams                        0
Adams                        0
Adams                        0
...                        ...
Whitley                      2
Whitley                      1
Whitley                      2
Whitley                      2
Whitley                      0

[25208 rows x 1 columns]

In [8]:
hospital_df = indiana_transformed.groupby('county').sum()
print(hospital_df)

             hospitalization_count
county
Adams                          155
Allen                         1469
Bartholomew                    330
Benton                          40
Blackford                       65
...                            ...
Washington                      73
Wayne                          360
Wells                          115
White                          138
Whitley                         94

[92 rows x 1 columns]

In [9]:
hospital_df= pd.DataFrame(hospital_df)

hospital_df

             hospitalization_count
county
Adams                          155
Allen                         1469
Bartholomew                    330
Benton                          40
Blackford                       65
...                            ...
Washington                      73
Wayne                          360
Wells                          115
White                          138
Whitley                         94

[92 rows x 1 columns]

In [10]:
indiana_transformed.loc["Marion"].sum()

hospitalization_count    4490
dtype: int64

INDIANA DEPARTMENT OF HEALTH TRANFORMATION

In [12]:
# Create a filtered dataframe from specific columns
nyt_cols = ["COUNTY_NAME", "COVID_COUNT", "COVID_DEATHS"]
doh_transformed= doh_db[nyt_cols].copy()
doh_transformed.head()

# Rename the column headers
doh_transformed = doh_transformed.rename(columns={"COUNTY_NAME": "county",
                                                 "COVID_COUNT": "covid_cases",
                                                 "COVID_DEATHS": "covid_deaths"})
doh_transformed.head()


# Clean the data by dropping duplicates and setting the index
doh_transformed.set_index("county", inplace=True)

doh_transformed

             covid_cases  covid_deaths
county
Adams               1959            24
Allen              21054           342
Bartholomew         3915            66
Benton               465             3
Blackford            673            17
...                  ...           ...
Washington           916             9
Wayne               3702            96
Wells               1471            36
White               1562            24
Whitley             1661            17

[92 rows x 2 columns]

CONNECTION

In [13]:
connection_string = "postgres:postgres@localhost:5432/indiana_covid"
engine = create_engine(f'postgresql://{connection_string}')

In [14]:
# Confirm tables
engine.table_names()

['cases_and_deaths', 'hospital']

In [24]:
hospital_df.to_sql(name='hospital', con=engine, if_exists='replace', index=True)

In [21]:
doh_transformed.to_sql(name= 'cases_and_deaths', con=engine, if_exists= 'replace', index= True)